*** pkgconfig test
#+BEGIN_SRC sh :results output :noweb yes
<<cabalHelpers>>
<<pkgconfig>>
cd ../ffmpeg-light
pkgconfigDepends
PKGS=($(pkgconfigDepends))
echo "There are ${#PKGS[@]} pkg deps"
#+END_SRC

#+RESULTS:
: libavutil
: libavformat
: libavcodec
: libswscale
: There are 4 pkg deps

*** Test
#+BEGIN_SRC sh :noweb yes :results output
<<dryDependencies>>
<<flagsFor>>
#cd ../GLUtil
#cd CabbageDown2
cd ../Frames
dryDependencies
#+END_SRC

#+RESULTS:
#+begin_example
Boolean 0.2.3
NumInstances 1.4
OneTuple 0.2.1
abstract-par 0.3.3
ansi-terminal 0.6.2.1
ansi-wl-pprint 0.6.7.2
base-prelude 0.1.16
base64-bytestring 1.0.0.1
cereal 0.4.1.1
clock 0.4.1.3
colour 2.3.3
data-default-class 0.0.1
data-default-instances-base 0.0.1
data-default-instances-containers 0.0.1
data-default-instances-old-locale 0.0.1
digest 0.0.1.2
dlist 0.7.1.1
data-default-instances-dlist 0.0.1
data-default 0.5.3
erf 2.0.0.0
fingertree 0.1.0.1
groups 0.4.0.0
network 2.6.0.2
newtype 0.2
parallel 3.2.0.6
prelude-extras 0.4
primitive 0.5.4.0
random 1.1
abstract-deque 0.3
reflection 1.5.1.2
split 0.2.2
stm 2.4.4
syb 0.4.4
tagged 0.7.3
text 1.2.0.4
blaze-builder 0.3.3.4
blaze-markup 0.6.3.0
cookie 0.4.1.4
hashable 1.2.3.2
case-insensitive 1.2.0.4
http-types 0.8.6
mime-types 0.1.0.6
nats 1
readable 0.3.1
scientific 0.3.3.8
attoparsec 0.12.1.3
transformers 0.4.3.0
StateVar 1.1.0.0
lens-family-core 1.2.0
mmorph 1.0.4
mtl 2.2.1
blaze-svg 0.3.4.1
monad-par-extras 0.3.3
operational 0.2.3.2
parsec 3.1.9
network-uri 2.6.0.1
pipes 4.1.4
statestack 0.2.0.3
transformers-compat 0.4.0.4
distributive 0.4.4
exceptions 0.8.0.2
intervals 0.7.1
optparse-applicative 0.11.0.2
transformers-base 0.4.4
monad-control 1.0.0.4
list-t 0.4.3
tuple 0.3.0.2
unordered-containers 0.2.5.1
semigroups 0.16.2.2
utf8-string 1
publicsuffixlist 0.1
vector 0.10.12.2
FontyFruity 0.5
aeson 0.8.0.2
foldl 1.0.8
mwc-random 0.13.3.0
monad-par 0.3.4.7
vector-algorithms 0.6.0.3
vector-binary-instances 0.2.1.0
vector-th-unbox 0.2.1.2
math-functions 0.1.5.2
statistics 0.13.2.3
vinyl 0.5.1
void 0.7
MemoTrie 0.6.2
contravariant 1.3.1
comonad 4.2.5
semigroupoids 4.3
bifunctors 4.2.1
monoid-extras 0.3.3.5
dual-tree 0.2.0.5
profunctors 4.4.1
free 4.11
lens 4.7
Chart 1.3.3
vector-space 0.9
active 0.1.0.18
vector-space-points 0.2.1
diagrams-core 1.2.0.5
xml 1.3.14
zlib 0.5.4.2
JuicyPixels 3.2.3
Rasterific 0.5.1
diagrams-lib 1.2.0.8
SVGFonts 1.4.0.3
diagrams-postscript 1.1.0.4
diagrams-rasterific 0.1.0.7
diagrams-svg 1.1.0.4
Chart-diagrams 1.3.3
streaming-commons 0.1.10.0
http-client 0.4.9
zip-archive 0.2.3.7
#+end_example


#+BEGIN_SRC sh :noweb yes :results output
<<dryDependencies>>
cd CabbageDown2
dryDependencies > buildplan
DEPS=($(buildplanDependencies))
echo "We have ${#DEPS[@]} dependencies: ${DEPS[@]}"
#+END_SRC

#+RESULTS:
: We have 3 dependencies: colour-2.3.3 unix-2.7.1.0 directory-1.2.1.0

** Tests
Test that we can append the new time stamps to an empty list, and
replace old timestamps for the correct GHC version in a populated list.

#+BEGIN_SRC sh :noweb yes :results output :exports none
<<updateTimeStamps2>>
ghcPlatform="x86_64-osx-ghc-7.8.4"
deps=("/A/B/C" "/Foo/Bar Me/Baz")
oldStampsEmpty="[]"
oldStampsPop="[(\"x86_64-osx-ghc-7.8.3\", [(\"/A/B/C\", 42)]),\
(\"x86_64-osx-ghc-7.8.4\", [(\"/A/B/C\", 42),(\"/Foo/Bar/Baz\", 42)])]"

updateTimeStamps "$ghcPlatform" deps[@] "$oldStampsEmpty"
updateTimeStamps "$ghcPlatform" deps[@] "$oldStampsPop"
#+END_SRC

#+RESULTS:
: [("x86_64-osx-ghc-7.8.4",[("/A/B/C",1425593674),("/Foo/Bar Me/Baz",1425593674)])]
: [("x86_64-osx-ghc-7.8.3", [("/A/B/C", 42)]),("x86_64-osx-ghc-7.8.4",[("/A/B/C",1425593674),("/Foo/Bar Me/Baz",1425593674)])]

** Distribute flags to the targeted cabbages
Read in a ~cabbage.config~ file, and copy the relevant parts of the
file to each named dependency in the ~.cabbages~ directory.

There is only /one/ ~flags~ stanza in a ~cabbage.config~ file. Once
we've finished processing it, we can quit.

#+NAME: sowFlagsAwk
#+BEGIN_SRC awk
BEGIN { FS = ":"; inFlags = 0;}
/flags:/ { inFlags = 1; }
/^[^[:space:]]/ { if(inFlags == 2) { exit 0; } }
{
  if(inFlags == 1) {
    inFlags = 2;
  } else if(inFlags == 2) {
    gsub(/^[[:space:]]*/,"",$1);
    cmd = sprintf("find .cabbages -maxdepth 1 -name '%s-[[:digit:].]*'", $1);
    if( (cmd | getline versionedName) ) {
      flags = sprintf("flags:\n  %s:%s\n", $1, $2);
      cmd = sprintf("echo '%s' > .cabbages/$(basename \"%s\")/cabbage.config", flags, versionedName);
      system(cmd);
    } else {
      # print "Ignoring flag for unknown dependency:", $1
    }
  }
}
#+END_SRC

#+NAME: sowFlags
#+BEGIN_SRC sh :noweb yes :tangle cabbage :exports code

# Takes a cabbage.config file and distributes subset cabbage.config
# files to directories in the .cabbages directory on an as-needed
# basis. Specifically, the flags for a named package will be copied
# into a cabbage.config file in that package's directory.
sowFlags() {
  local AWK
  read -r -d '' AWK<<'EOF'
<<sowFlagsAwk>>
EOF
  awk "$AWK"
}
#+END_SRC

#+BEGIN_SRC sh :results output :noweb yes
<<sowFlags>>
cd ~/temp/diagrams-lib-1.2.0.8
cat cabbage.config | sowFlags
#+END_SRC

#+RESULTS:
: Ignoring flag for unknown dependency: flingle

**** Array membership
Adapted from [[http://stackoverflow.com/questions/3685970/check-if-an-array-contains-a-value][this StackOverflow question]]

#+NAME: findIndex
#+BEGIN_SRC sh :exports code :tangle cabbage

# Takes an element and an array, returns -1 if the element is /not/ in
# the array; or its index if it is.
findIndex() {
  local i
  declare -a arr=("${!2}")
  for i in "${!arr[@]}"; do 
    [[ "${arr[$i]}" == "$1" ]] && echo $i && return 0; done
  echo "-1"
  return 1

  # for e in "${@:2}"; do [[ "$e" == "$1" ]] && return 0; done
  # return 1
}
#+END_SRC

#+BEGIN_SRC sh :exports none :noweb yes :results output
<<findIndex>>
ARR=("hey" "you guys" "here I" "come")
echo $(findIndex "you guys" ARR[@])
#+END_SRC

#+RESULTS:
: 1

**** Getting add-sourced dependency package names
We use =cabal sandbox list-sources= to get the directories of added
sources, then =getAddedPackageName= to get the name+version of the
package in each directory.

#+BEGIN_SRC sh :noweb yes :exports none :results output
<<getAddedSources>>
<<getAddSource>>

LISTEDSOURCES="$(cd CabbageDown && cabal sandbox list-sources))"
ADDEDSOURCEDIRS=($(echo "$LISTEDSOURCES" | getAddedSources))

# We want the package name of each added source.
for i in "${!ADDEDSOURCEDIRS[@]}"; do
  ADDEDSOURCES[$i]=$(getAddedPackageName "${ADDEDSOURCEDIRS[$i]}")
done
echo "${ADDEDSOURCES[*]}"
#+END_SRC

#+RESULTS:
: TestCabbage-0.1.0.0 TestCabbage2-0.1.0.0

**** getDependencySources
Now we can define a function capable of getting the source for a
dependency that has been add-sourced to a sandbox /or/ that is
available from hackage via =cabal get=.

#+NAME: getDependencySources
#+BEGIN_SRC sh :exports code :tangle cabbage

# Get all dependency sources for the package in the current
# directory. This handles add-sourced dependencies, or those that
# "cabal get" can get (i.e. from hackage).
getDependencySources() {
  local ADDEDSOURCEDIRS=($(cabal sandbox list-sources | getAddedSources))
  local ADDEDSOURCEPACKAGES
  local i
  for i in "${!ADDEDSOURCEDIRS[@]}"; do
    ADDEDSOURCEPACKAGES[$i]=$(getAddedPackageName "${ADDEDSOURCEDIRS[$i]}")
  done
  local DEPS=($(buildplanDependencies))
  mkdir -p .cabbages
  local d
  for d in "${DEPS[@]}"; do
    i=$(findIndex "$d" ADDEDSOURCEPACKAGES[@])
    if [ "$i" -gt "-1" ]; then
      echo "Getting add-source dependency: $d"
      getAddSource "${ADDEDSOURCEDIRS[$i]}"
    elif [ -d .cabbages/"$d" ]; then
      echo "Using existing source dist of $d"
    elif [ "${d: -5}" == ".4552" ]; then
      echo "Cabbage patching globally installed package: $d"
      cabbagePatch "$d"
    else
      echo "Getting dependency: $d"
      cabal get "$d" -d .cabbages
    fi
  done
}
#+END_SRC

#+BEGIN_SRC sh :noweb yes :exports none :results output
<<getAddedSources>>
<<getAddSource>>
<<findIndex>>
<<getDependencySources>>
<<cabbagePatch>>

cd CabbageDown
getDependencySources
#+END_SRC

#+RESULTS:
: Getting add-source dependency: TestCabbage-0.1.0.0
: Getting dependency: colour-2.3.3
: Unpacking to .cabbages/colour-2.3.3/

**** A quick test
If we are in a sandbox directory, we get the package db string. If
not, we get an error message.

#+BEGIN_SRC sh :exports none :results output :noweb yes
<<getPackageDBPath>>
cd CabbageDown
RES=$(getPackageDBPath)
if [ $? -eq 0 ]; then
  echo "$RES"
else
  echo "Not in a sandbox!"
fi
#+END_SRC

#+RESULTS:
: x86_64-osx-ghc-7.8.4
**** Experiments
#+BEGIN_SRC sh :exports none
cd CabbageDown
cabal sandbox hc-pkg list | grep ".conf.d" | tail -n 1 | sed 's/.*\/\(.*\)-packages.conf.d.*/\1/'
#+END_SRC

#+RESULTS:
: x86_64-osx-ghc-7.8.4

#+BEGIN_SRC sh :exports none
ghc-pkg list | grep ".conf.d" | tail -n 1 | sed 's/.*\/\(.*\)\/package.conf.d.*/\1/'
#+END_SRC

#+RESULTS:
: x86_64-darwin-7.8.3

#+BEGIN_SRC sh : exports none
#cd CabbageDown
cabal sandbox hc-pkg list > /dev/null
echo $?
#+END_SRC

#+RESULTS:
: 1


***** Test
#+BEGIN_SRC sh :noweb yes :results output
<<getSynopsis>>
cd ~/Documents/Projects/Frames 
getSynopsis
#+END_SRC

#+RESULTS:
: Data frames For working with tabular data files 

**** The bash code

#+NAME: mkCabbage
#+BEGIN_SRC sh :exports code :tangle cabbage :noweb yes

# Define an attribute for each package. Takes an array of attribute
# names, and an array of corresponding directory names that are home
# to Nix package definitions (these are all in the .cabbages
# directory).
callCabbages() {
  local -a NAMES=("${!1}")
  local -a PKGS=("${!2}")
  local i

  for ((i = 0; i < ${#NAMES[@]}; ++i)); do
    local TOOLSARR=($(cd .cabbages/${PKGS[$i]} && allBuildTools))
    local TOOLS=""
    if [ ${#TOOLSARR[@]} -gt 0 ]; then
      TOOLS=" $(echo ${TOOLSARR[@]})"
    fi
    echo "      ${NAMES[$i]} = callPackage .cabbages/${PKGS[$i]} {"
    echo "        inherit frozenCabbages haskellBuildTools pkgs$TOOLS;"
    echo "      };"
  done
}

# Build a .nix file from a .cabal file in the current directory Takes
# the ghcPlatform string, this package's name, and whether or not this
# package should define frozenCabbages: 0 = this is an upstream
# package, 1 = this is a downstream package, 2 = this is a build-tool.
mkCabbage() {
  local NIX
  local FROZENUPSTREAM
  local FROZENDEF
  local LINKSANDBOX
  local DEPS=($(buildplanDependencies))
  local DEPNAMES=($(cat buildplan | sed 's/ .*$//'))

  if [ $3 -gt 0 ]; then
    # This is /the/ downstream package or a build-tool

    # We will need the standard callPackage function
    FROZENUPSTREAM="callPackage"

    # We will define the frozenCabbages attribute
    IFS=$'\n' read -r -d '' FROZENDEF <<EOF
frozenCabbages = rec {
$(callCabbages DEPNAMES[@] DEPS[@])
    };
EOF

    # We will seed the sandbox /in this directory/ with our
    # dependencies in the nix store so the user can continue using a
    # standard cabal workflow (e.g. tools like ghc-mod).
    mkdir -p .cabal-sandbox/lib/"$1"
    LINKSANDBOX="ln -sFf \${pkg.outPath}/.cabal-sandbox/$1-packages.conf.d/*.conf "$(pwd)"/.cabal-sandbox/$1-packages.conf.d/\n";

    # We create a dummy sdist file so that the src attribute on the
    # downstream package's nix expression is a file, even if its
    # contents are currently bogus. This is done so that Nix can
    # evaluate the expression and install dependencies, without which
    # the configure phase (run in order to produce the sdist) of the
    # downstream package can fail due to missing dependencies.
    if ! [ -d "./dist" ]; then
      mkdir dist
    fi
    if ! [ -f "./dist/$2.tar.gz" ]; then
      touch "./dist/$2.tar.gz"
    fi
  else
    # This is an upstream package (dependency)
    FROZENUPSTREAM="frozenCabbages"
  fi

  local SYNOPSIS=$(getSynopsis)
  local SYSTEMDEPS=""

  if [ -f ../../cabbage.config ]; then
    local MYNAME=$(unversionPackageName "$2")
    SYSTEMDEPS=$(cat ../../cabbage.config | systemDepsFor "$MYNAME")
  fi
  if [ -f cabbage.config ]; then
    local MYNAME=$(unversionPackageName "$2")
    SYSTEMDEPS=$(cat cabbage.config | systemDepsFor "$MYNAME")
  fi
  local PKGS=($(pkgconfigDepends))

  if [ "${#PKGS[@]}" -gt 0 ]; then
    SYSTEMDEPS="$SYSTEMDEPS pkgconfig"
  fi

  local TOOLS=($(allBuildTools))
  local TOOLSDEPS=""
  if [ "${#TOOLS[@]}" -gt 0 ]; then
    TOOLSDEPS=$(echo "${TOOLS[@]}" | awk '{for(i=1;i<=NF;i++) printf(", %s",$(i));}')
  fi

  local FRAMEWORKS=($(cabalFrameworks))
  local NIXLD
  if [ "${#FRAMEWORKS[@]}" -gt 0 ]; then
    local fw
    NIXLD="\
  NIX_LDFLAGS = lib.optionalString stdenv.isDarwin \""
    for fw in "${FRAMEWORKS[@]}"; do
      NIXLD="$NIXLD -framework $fw"
    done
    NIXLD="$NIXLD\";"
  else
    NIXLD=""
  fi

  # Now we build up the Nix expression
  IFS=$'\n' read -r -d '' NIX <<EOF
{ stdenv, lib, haskellBuildTools, pkgs$TOOLSDEPS, $FROZENUPSTREAM }:
let cabalTmp = "cabal --config-file=./.cabal/config";
    $FROZENDEF
    mkCmd = pkg: let nm = lib.strings.removePrefix "haskell-" pkg.name;
                     p = pkg.outPath;
                     pkgPath = ".cabal-sandbox/$1-packages.conf.d";
                 in ''ln -sFf \${p}/\${pkgPath}/*.conf \$out/\${pkgPath}/
                    '';
$(if [ $3 -gt 0 ]; then
    echo "    mkSetupCmd = pkg: let nm = lib.strings.removePrefix \"haskell-\" pkg.name;"
    echo "                          p = pkg.outPath;"
    echo "                      in \"$LINKSANDBOX\";"
  fi)
in
stdenv.mkDerivation rec {
  name = "haskell-$2";
  src = $(if [ $3 -eq 1 ]; then 
            echo "./dist/$2.tar.gz"
          else
            echo "./."
          fi);
  cabbageDeps = with frozenCabbages; [ $(echo "${DEPNAMES[@]}") ];
  systemDeps = (with pkgs; [ $SYSTEMDEPS ]) ++
               lib.lists.unique (lib.concatMap (lib.attrByPath ["systemDeps"] []) cabbageDeps);
  propagatedBuildInputs = systemDeps;$NIXLD
  buildInputs = [ stdenv.cc $(echo "${TOOLS[@]}")] ++ haskellBuildTools ++ cabbageDeps ++ systemDeps;

  # Build the commands to merge package databases
  cmds = lib.strings.concatStrings (map mkCmd cabbageDeps);
$(if [ $3 -gt 0 ]; then
    cat << SETUPEOF
  setupCmds = lib.strings.concatStrings (map mkSetupCmd cabbageDeps);
  setup = builtins.toFile "setup.sh" ''
    <<updateTimeStamps>>
    eval "\$setupCmds"
    \${cabalTmp} sandbox hc-pkg recache
    SRCS=(\$(cabal sandbox list-sources | sed '1,/^\$/ d' | sed '/^\$/,\$ d'))
    OLDTIMESTAMPS=\$(cat .cabal-sandbox/add-source-timestamps)
    updateTimeStamps "$1" SRCS[@] "\$OLDTIMESTAMPS" > .cabal-sandbox/add-source-timestamps
  '';
SETUPEOF
  fi)

  builder = builtins.toFile "builder.sh" ''
    source \$stdenv/setup
    mkdir \$out

    if [ -d "\$src" ]; then
      cp -R "\$src"/* .
      #*/
      if [ -f \$src/buildplan ]; then
        mkdir \$out/.cabbageCache
        cp "\$src/buildplan" "\$out/.cabbageCache/buildplan"
      fi
    else
      tar xf "\$src" --strip=1
    fi

    chmod -R u+w .
    if [ -d dist ]; then
      # Copy pre-generated dist files to store
      cp -R dist \$out
    fi
    \${cabalTmp} sandbox --sandbox=\$out/.cabal-sandbox init -v0
    mkdir -p \$out/.cabal-sandbox/lib/$1
    eval "\$cmds"
    \${cabalTmp} sandbox hc-pkg recache

    \${cabalTmp} --builddir=\$out/dist --bindir=\$out/bin --libdir=\$out/.cabal-sandbox/lib --with-gcc=\$CC configure \$(echo \$NIX_LDFLAGS | awk -e '{ for(i=1;i <= NF; i++) { if(match(\$(i), /^-L/)) printf("--extra-lib-dirs=%s ", substr(\$(i),3)); } }')
    echo "Building..."
    \${cabalTmp} --builddir=\$out/dist build -v0
    \${cabalTmp} --builddir=\$out/dist copy
    \${cabalTmp} --builddir=\$out/dist register
    \${cabalTmp} --builddir=\$out/dist clean || true
  '';    
  meta = {
    description = "$SYNOPSIS";
  };
}
EOF

  echo "$NIX" > default.nix
}

# Freezes the cabal file in the current directory. Takes the versioned
# name of the package to prepare, and the dbPath for the current
# platform (e.g. x86_64-osx-ghc-7.8.4).
prepCabbage() {
  local d="$1"
  local dbPath="$2"
  local FLAGS
  cabal sandbox init --sandbox=../../.cabal-sandbox > /dev/null

  if [ -f cabal.config ]; then
    mv cabal.config cabal.config.bak
  fi

  ln -s ../../bpconstraints cabal.config

  if [ -n "$FLAGS" ]; then
    freezeCabbagePatch 0 > /dev/null
  else
    freezeCabbagePatch > /dev/null
  fi

  rm cabal.config
  if [ -f cabal.config.bak ]; then
    mv cabal.config.bak cabal.config
  fi

  rm cabal.sandbox.config
  mkCabbage "$dbPath" "$d" 0
}

# Takes a flag to determine if the dependencies of all targets should
# be built. If the flag is true, then the build-depends of all targets
# are consolidated and considered when determining a build plan. The
# second argument is another flag for which true indicates this is a
# downstream package, and false indicates this is a build-tool.
mkCabbages() {
  local NUMCABALS=$(find . -maxdepth 1 -name '?*.cabal' | wc -l)
  if [ "$NUMCABALS" -gt 1 ]; then
    echo "Error: Found multiple cabal files in $(pwd)!"
    exit 1
  fi

  if [ "$1" = true ]; then
    freezeCabbagePatch 2
  else
    freezeCabbagePatch 1
    if ! [ $? -eq 0 ]; then
      if [ "$2" = false ]; then
        echo "Trying emergency constraint patch..."
        freezeUnconstrained
      fi
    fi
  fi
  if [ -f "$CABAL.cabbage.bak" ]; then
    mv "$CABAL.cabbage.bak" "$CABAL"
  fi
  local RES=$?
  if [ $RES -ne 0 ]; then
    echo "Freezing the downstream package $(pwd) failed ($RES)" && false
  else
    echo "Froze downstream package at $(pwd)"
  fi
  local dbPath=$(getPackageDBPath)
  local deps=($(buildplanDependencies))
  getDependencySources
  if [ -f cabbage.config ]; then
    cat cabbage.config | sowFlags
  fi

  # Print a message if there are extra-libraries sepecified in any
  # .cabal file used to build the downstream package that is not
  # obviously guarded by an os(windows) or os(solaris) check.
  warnExtraLibraries

  # Build a constraints file the upstream packages can use when
  # computing their own build plans.
  buildplanConstraints > bpconstraints

  pushd .cabbages > /dev/null
  local d
  for d in "${deps[@]}"; do
    echo "Making cabbage: $d"
    if [ -f "$d"/default.nix ]; then
      echo "Using existing default.nix"
    else
      (cd "$d" && prepCabbage "$d" "$dbPath")
    fi
  done
  popd > /dev/null
  rm bpconstraints

  local BUILDTOOLS=($(allBuildTools))

  if [ "${#BUILDTOOLS}" -gt 0 ]; then
    echo "Making cabbages for build-tools"
    pushd .cabbages > /dev/null
    local bt
    for bt in "${BUILDTOOLS[@]}"; do
      cabal get "$bt"
      if ! [ $? -eq 0 ]; then
        local ANS
        read -p "cabal get did not unpack $bt, should we continue? [Y/n]" -n 1 -t 5 ANS
        echo
        if [ "$ANS" = "n" ]; then
          exit 1
        fi
      fi
      local d=$(basename $(find . -name "$bt-[[:digit:].]*" -depth 1))
      echo "Making build-tool cabbage: $d"
      (cd "$d" && cabal sandbox init && mkCabbages false false)
    done
    popd > /dev/null
  fi
  
  if [ "$2" = true ]; then
    mkCabbage "$dbPath" "$(getMyFullName)" 1
  else
    mkCabbage "$dbPath" "$(getMyFullName)" 2
  fi
}
#+END_SRC

#+BEGIN_SRC sh :exports none :results output :noweb yes
<<getPackageDBPath>>
<<mkCabbage>>
<<getAddedSources>>
<<getAddSource>>
<<findIndex>>
<<getDependencySources>>
<<dummyCabalLibrary>>
<<cabbagePatch>>

(cd CabbageDown && mkCabbages)
#+END_SRC

#+RESULTS:
: Resolving dependencies...
: Froze downstream package at /Users/acowley/Documents/Projects/Cabbage/CabbageDown
: Getting add-source dependency: TestCabbage-0.1.0.0
: Using existing source dist of colour-2.3.3
: Making cabbage: TestCabbage-0.1.0.0
: Preparing /Users/acowley/Documents/Projects/Cabbage/CabbageDown/.cabbages/TestCabbage-0.1.0.0
: Resolving dependencies...
: Making cabbage: colour-2.3.3
: Preparing /Users/acowley/Documents/Projects/Cabbage/CabbageDown/.cabbages/colour-2.3.3

**** A quick test
#+BEGIN_SRC sh :results output :exports none :noweb yes
<<mkDummyCabal>>
mkDummyCabal "foo-0.8.2"
#+END_SRC

#+RESULTS:
: cabal-version:      >=1.10
: 
: executable Dummy
:   build-depends:    foo ==0.8.2

